Repository: mozilla-l10n/mt-training-data
Catalog: ha/ha_pontoon.tmx
Source language: en_us
Languages: ha

source: We’re crowdsourcing an open-source dataset of voices. Donate your voice, validate the accuracy of other people’s clips, make the dataset better for everyone.
ha: Muna tura tarin bayanai na muryoyi-buɗe-tushe. Ba da gudummawa ga muryarka, tabbatar da daidaitattun shirye-shiryen bidiyo na wasu mutane, sanya dataset ɗin ta zama mafi kyau ga kowa da kowa.

source: We’re experiencing unexpected downtime
ha: Muna fuskantar saukar da lokacin aiki na bazata

source: We’re sorry, your platform is not currently supported.
ha: Yi hakuri, ba'a tallafa wa dandalinku a halin yanzu.

source: We've run out of clips to validate in this language...
ha: Shirye-shiryen bidiyo sun ƙare don ingantawa a cikin wannan yaren ...

source: We've run out of sentences to record in this language...
ha: Shirye-shiryen bidiyo sun ƙare don ingantawa a cikin wannan yaren ...

source: We want the Common Voice dataset to reflect the audio quality a speech-to-text engine will hear in the wild, so we’re looking for variety. In addition to a diverse community of speakers, a dataset with varying audio quality will teach the speech-to-text engine to handle various real-world situations, from background talking to car noise. As long as your voice clip is intelligible, it should be good enough for the dataset.
ha: Muna son bayanan Common Voice don yin tunannin ingancin sauti injin injin magana-zuwa-rubutu zai ji a cikin daji, don haka muna neman iri-iri. Baya ga al'umma masu yawan magana, dataset mai yawan ingancin sauti za ta koyar da injin magana-zuwa-rubutu don ɗaukar yanayi daban-daban na duniya, daga magana zuwa hayaniyar mota. Duk lokacin da muryar muryarku ta kasance mai fahimta, ya kamata ya isa isa ga tsarin bayanai.

source: We will be in touch with more information about how to add your language to Common Voice very soon.
ha: Za mu kasance tare da ƙarin bayani game da yadda ake ƙara harshenku zuwa Common Voice ba da daɗewa ba.

source: We will be in touch with more information as it becomes available.
ha: Za mu ci gaba da ba ku ƙarin bayani yayin da ya samu.

source: We will not make your email public.
ha: Ba za mu bayyana adireshin yanar gizonka ba ga jama'a.

source: We will review your request to remove your voice recordings from the dataset. If your request is approved, we will contact those who have downloaded the dataset and request they remove your voice recordings as well.
ha: Za mu duba buƙatarka ta cire sautikan muryarka daga cikin bayanan (dataset). Idan an yarda da buƙatarka, za mu tuntuɓi waɗanda suka sauke bayanan (dataset) ɗin domin suma su cire sautikan muryarka.

source: What does it mean that I can’t “determine the identity” of speakers in the Common Voice dataset?
ha: Me ake nufi da cewa ba zan iya “ƙayyade asalin” masu magana a cikin tsarin tattara bayanan Common Voice ba?

source: What is Common Voice?
ha: Mene ne Common Voice?

source: What issues are you experiencing with this sentence?
ha: Waɗanne matsaloli kuke fuskanta game da wannan hukuncin?

source: What kind of goal do you want to build?
ha: Wace irin buri kake so ka gina?

source: What level of audio quality is required for a voice clip to be used in the dataset?
ha: Wane matakin ingancin sauti ake buƙata don shirin murya da za a yi amfani da shi a cikin bayanan bayanan?

source: What’s inside the Common Voice dataset?
ha: Meye a cikin bayanan Common Voice?

source: What's Public?
ha: Menene a bainan Jama'a?

source: What’s the difference between Common Voice and Deep Speech?
ha: Meye bambancin dake tsakanin Common Voice da Deep Speech?

source: When a user rejects a voice clip it returns to the Queue. If rejected a second time, the voice clip is moved to the Clip Graveyard.
ha: Idan mai amfani ya ƙi shirin bidiyo sai ya koma layi. Idan aka ƙi shi a karo na biyu, za a matsar da muryar murya zuwa Makabartar Clip.

source: When will you release Common Voice data in other languages?
ha: Yaushe zaku saki bayanan Common Voice a sauran harsuna?

source: Where does the source text come from?
ha: Daga ina aka samo rubutun?

source: Why ?
ha: Me yasa?

source: Why a profile?
ha: Meyasa ake buƙatar bayanai na?

source: Why Common Voice?
ha: Me yasa muke Common Voice?

source: Why does this matter?
ha: Me yasa wannan al'amarin yake da muhimmanci?

source: Why don’t you ask people to read from books or Wikipedia articles in different languages?
ha: Me ya sa ba ku tambayar mutane su karanta daga littattafai ko rubutun Wikipedia a cikin yare daban-daban?

source: Why do you need so many different speakers per language?
ha: Me ya sa kuke bukatar masu magana da yawa a kowane harshe?

source: Why is 10,000 validated hours the per language goal for capturing audio?
ha: Me yasa sa'o'i 10,000 masu inganci suka zama kowace manufa ta yare don ɗaukar sauti?

source: Why is Common Voice part of the Mozilla mission?
ha: Me yasa Common Voice yake cikin burikan Mozilla?

source: Why is it important?
ha: Me ya sa yake da muhimmanci?

source: Why is my language not included yet?
ha: Me ya sanya ba'a saka yarena ba har yanzu?

source: Why should I sign up for an account?
ha: Don me zan buɗe asusu?

source: Would you like to request your voice recordings be deleted too, or do you prefer to keep them in the Common Voice dataset?
ha: Kuna so ku nemi rikodin muryar ku a goge, ko kun fi so a ajiye su a cikin bayanan Common Voice?

source: Yes
ha: Ee

source: Yes, send me emails. I’d like to stay informed about the Common Voice Project.
ha: Eh, aika min da saƙonnin yanar gizo. Ina son in kasance da samun bayanai a kan aikin Common Voice

source: Yes, send me emails. I'd like to stay informed about the progress of this language on Common Voice.
ha: Na amince a aika min sakon yanar gizo. Ina son in samu bayanai akan cigaban da ake samu a kan wannan yaren ta kafar Common Voice.

source: Yes, we especially want your voice! Part of the aim of Common Voice is to gather as many different accents as possible so that voice recognition services work equally well for everyone. This means donations from non-native speakers are particularly important.
ha: Eh, muna son muryar ku musamman! Wani ɓangare na manufar Common Voice ita ce tattara lafazi daban-daban yadda ya yiwu don sabis ɗin gane murya suyi aiki daidai ga kowa. Wannan yana nufin gudummawa daga masu magana da ba 'yan ƙasa da suna da mahimmanci.

source: You
ha: Kai

source: You are about to initiate a download of <size>{ $size }GB</size>, proceed?
ha: Kana gab da fara saukar da <size>{ $size }GB</size>, ci gaba?

source: You are prepared to initiate a download of <b>{ $size }</b>
ha: Ka shirya don fara saukar da<b>{ $size }</b>

source: You can choose to make your username public or anonymous.
ha: Zaka iya zaɓar bayyana username a fili ko a asurce.

source: You can help build a diverse, open-source dataset by creating a Common Voice profile and contributing your voice.
ha: Kuna iya taimakawa ƙirƙirar ɗakunan bayanai daban-daban, masu buɗewa ta hanyar ƙirƙirar bayanan Murya na gama gari da bayar da gudummawar muryar ku.

source: You must allow microphone access.
ha: Dole ne ka ƙyale samun damar microphone.

source: Your anonymous voice recordings will remain in the Common Voice dataset. Once you delete your profile you will no longer be able to submit a request to remove your recordings from the dataset
ha: Rikodin muryar ku da ba a sani ba zai kasance a cikin kundin bayanan Murya na gama gari. Da zarar ka share bayanan ka ba za ka iya sake gabatar da buƙata don cire rikodin ka daga bayanan ba

source: Your avatar now includes a voice clip!
ha: Avatar ka yanzu na haɗe da ɓangare-ɓangare!

source: Your daily goal has been created
ha: An ƙirƙiri burin ku na yau da kullum

source: Your download has started.
ha: Abunda ka ke son saukewa ya fara saukuwa.

source: You’re contributing to a target segment
ha: Kana ba da gudummawa ga ɓangaren hadafinmu na farko

source: You’re contributing to our first target segment
ha: Kana ba da gudummawa ga ɓangaren hadafinmu na farko

source: You're currently set to <bold>NOT</bold> receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ha: Yanzu haka an saite kake domin <bold>KADA KA</bold> ƙarɓi sakonnin imel kamarsu tunatarwar buri, bayanai game da ci gaba ta da wasikan bayanai akan Common Voice

source: You're currently set to receive emails such as goal reminders, my progress updates and newsletters about Common Voice
ha: Yanzu haka kana shirye don ƙarɓan sakonnin imel kamar su tunatarwar buri, bayani game da cigaba ta da wasikun bayanai game da Common Voice

source: Your Languages
ha: Yarenku

source: Your username and email will not be associated with the published data.
ha: Ba za a haɗa sunanka ba ko email ɗinka ba tare da bayanan da aka buga.

source: Your weekly goal has been created
ha: An kirkiro burin ka na mako-mako

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } recording goal!
ha: ka taimaka wa Common Voice ta kai ga<goalPercentage></goalPercentage> cimma burin mu na yau da kullum { $goalValue } da inganci!

source: You've helped Common Voice reach <goalPercentage></goalPercentage> of our daily { $goalValue } validation goal!
ha: Ka taimaka wa Common Voice ta kai ga<goalPercentage></goalPercentage> cimma burin mu na yau da kullum { $goalValue } da inganci!

source: You've successfully signed up for contributing to { $language }. Thank you.
ha: Kayi nasarar sanya hannu don tallafa wa yaran { $language } . Mun gode.

source: 1 Review
ha: Nazari 1{numReviews} Nazarce-nazarce

source: Adults Only 18+
ha: Manya Kawai 18+

source: All Platforms
ha: Duk dandali

source: Android Mobile
ha: Wayar hannu ta Android

source: Android Tablet
ha: Ƙarakar kwamfutar ta Android

source: An error occurred.
ha: Kuskure ya afku.

source: An internal server error occurred. Please try again later.
ha: An sami kuskuren ciki na uwar garke. Sake gwadawa nan gaba.

source: An update to Marketplace is available.
ha: Akwai sabuntawa zuwz ga Marketplace.

source: App for Albania
ha: Aikace-aikace domin AlbaniyaAikace-aikace domin Albaniya

source: App for Argentina
ha: Aikace-aikace domin ArgentinaAikace-aikace domin Argentina

source: App for Bangladesh
ha: Aikace-aikace domin BangladeshAikace-aikace domin Bangladesh

source: App for Brazil
ha: Aikace-aikace domin BrazilAikace-aikace domin Brazil

source: App for Bulgaria
ha: Aikace-aikace domin BugariaAikace-aikace domin Bulgaria

source: App for Chile
ha: Aikace-aikace domin ChileAikace-aikace domin Chile

source: App for China
ha: Aikace-aikace domin ChinaAikace-aikace domin China

source: App for Colombia
ha: Aikace-aikace domin ColombiaAikace-aikace domin Colombia

source: App for Costa Rica
ha: Aikace-aikace domin Costa RicaAikace-aikace domin Costa Rica

source: App for Croatia
ha: Aikace-aikace domin CroatiaAikace-aikace domin Croatia

source: App for Czech Republic
ha: Aikace-aikace domin Jamhuriyar CzechAikace-aikace domin Jamhuriyar Czech

source: App for Ecuador
ha: Aikace-aikace domin EcuadorAikace-aikace domin Ecuador

source: App for El Salvador
ha: Aikace-aikace domin El SalvadorAikace-aikace domin El Salvador

source: App for France
ha: Aikace-aikace domin FaransaAikace-aikace domin Faransa

source: App for Germany
ha: Aikace-aikace domin Jamus

source: App for Greece
ha: Aikace-aikace domin GreeceAikace-aikace domin Greece

source: App for Hungary
ha: Aikace-aikace domin HungaryAikace-aikace domin Hungary

source: App for India
ha: Aikace-aikace domin IndiaAikace-aikace domin India

source: App for Italy
ha: Aikace-aikace domin ItaliyaAikace-aikace domin Italiya

source: App for Japan
ha: Aikace-aikace domin JapanAikace-aikace domin Japan

source: App for Macedonia
ha: Aikace-aikace domin MacedoniaAikace-aikace domin Macedonia

source: App for Mexico
ha: Aikace-aikace domin MexicoAikace-aikace domin Mexico

source: App for Montenegro
ha: Aikace-aikace domin MontenegroAikace-aikace domin Montanegro

source: App for Nicaragua
ha: Aikace-aikace domin NicaraguaAikace-aikace domin Nicaragua

source: App for Panama
ha: Aikace-aikace domin Panama

source: App for Peru
ha: Aikace-aikace domin Peru

source: App for Poland
ha: Aikace-aikace domin Poland

source: App for Russia
ha: Aikace-aikace domin Rasha

source: App for Serbia
ha: Aikace-aikace domin Serbia

source: App for South Africa
ha: Aikace-aikace domin Afirka ta Kudu

source: App for Spain
ha: Aikace-aikace domin Spain

source: App for Uruguay
ha: Aikace-aikace domin Uruguay

source: App for Venezuela
ha: Aikace-aikace domin VenezuelaAikace-aikace domin Venezuela

source: App install error: {error}
ha: Kuskuren saka aikace-aikace: {error}

source: {app_name} screenshot
ha: {app_name} hoton allon fuskar kwamfuta

source: App not yet reviewed
ha: Ba'a yi nazarin aikace-aikace ba tukuna

source: App Review
ha: Nazarin aiki

source: Approve / Reject
ha: Amince / Ƙi amincewa

source: App Statistics
ha: Ƙididdigar Aikace-aikace

source: App usage statistics
ha: Ƙididdigar amfani da aikace-aikace

source: Arts & Entertainment App
ha: Aikace-aikace na Al'adu & Ɗabe kewaAikace-aikace na Al'adu & Ɗabe kewa

source: Back to app
ha: Koma zuwa Aikace-aikace

source: Back to {app}
ha: Koma {app}

source: <b>{n}</b> Result
ha: <b>{n}</b> Sakamako<b>{n}</b> Sakamako

source: <b>"{search_query}"</b> returned {n} result
ha: b>"{search_query}"</b> sakamako {n} da aka dawo da shi<b>"{search_query}"</b> sakamako {n} da aka dawo da su

source: Business
ha: Kasuwanci

source: Cancel
ha: Soke

source: Categories
ha: Jinsina

source: Compatibility
ha: Dacewa

source: Content Rating
ha: Tantance abin da ke ciki

source: Currently Offline
ha: Yanzu ba'a kan layi

source: Delete
ha: Goge

source: Description
ha: Kwatance

source: Desktop
ha: Fuskar kwamfuta

source: Develop Apps
ha: Gina Aikace-aikace

source: Developer
ha: Mai haɓakawa

source: Display Name
ha: Nuna Suna

source: Edit Listing
ha: Gyara jeri

source: Edit Review
ha: Gyara Nazari

source: Edit your review
ha: Gyara nazarinka

source: Edit your Review
ha: Gyara Nazarinka

source: Education
ha: Ilimi

source: Email Address
ha: Adireshin Imel

source: Email Support
ha: Tallafin Imel

source: Entertainment
ha: Ɗebe kewa

source: Error while communicating with server. Try again later.
ha: Kuskure yayin sadarwa da uwar garke. Sake gwadawa nan gaba.

source: Everyone 10+
ha: Kowa 10+

source: Except where otherwise <a href="{legal_url}" target="_blank">noted</a>, content on this site is licensed under the <a href="{cc_url}" target="_blank">Creative Commons Attribution Share-Alike License v3.0</a> or any later version.
ha: Sai wurin da ba'a <a href="{legal_url}" target="_blank">noted</a>, kayan da ke wannan dandalin an yi masa lasisi a ƙarƙashin <a href="{cc_url}" target="_blank>Creative Commons Attribution Share-Alike Licence v3.0</a> ko kowane sabon nau'i.

source: Expand
ha: Faɗaɗa

source: Featured Book App
ha: Aikace-aikacen Littafi Mai fitowa a kai a kaiAikace-aikacen Littafi Mai fitowa a kai a kai

source: Featured Creativity App
ha: Aikace-aikacen Ƙirƙira Mai fitowa a kai a kaiAikace-aikacen Ƙirƙira Mai fitowa a kai a kai

source: Featured Education App
ha: Aikace-aikacen Ilimi Mai fitowa a kai a kaiAikace-aikacen Ilimi Mai fitowa a kai a kai

source: Featured Game
ha: Wasa Mai fitowa a kai a kaiWasanni Masu fitowa a kai a kai

source: Featured Lifestyle App
ha: Aikace-aikacen Salon Rayuwa masu fitowa a kai a kai

source: Featured Music App
ha: Aikace-aiakcen Kiɗa na a kai a kai

source: Featured Shopping App
ha: Aikace-aikacen Cinikayya ta a kai a kai

source: Featured Social App
ha: Aikace-aikacen zamantakewa na a kai a kai

source: Featured Sports App
ha: Aikace-aikacen wasanni na a kai a kai

source: Featured Travel App
ha: Aikace-aikace na Tafiye-tafiye Masu Fitowa a kai a kai

source: Feedback
ha: Amsa

source: Feedback submitted. Thanks!
ha: An aika da amsa. Godiya!

source: File Size
ha: Girman Fayil

source: Firefox OS {version}
ha: Firefox 0S {version}

source: Flagged for review
ha: Saka alamar tuta domin nazari

source: Flagging review...
ha: Nazarin alama mai tuta...

source: Flag Review
ha: Saka alamar tuta ga Nazari

source: For ages {0}+
ha: Domin shekaru {0}+

source: For all ages
ha: Domin duk masu shekaru

source: For previous version {version}
ha: Domin yayi wanda ya gabata {version}

source: Free
ha: Kyauta

source: Games
ha: Wasanni

source: General settings
ha: Saituna na gaba ɗaya

source: Generic
ha: Na-baki-ɗaya

source: Get Firefox News.
ha: Sami Labaran Firefox.

source: Get Firefox news! Sign up for our newsletter
ha: Sami labaran Firefox! Yi rijista domin wasiƙarmu ta labarai

source: Get Help
ha: Sami Taimako

source: Give us your feedback. Let us know whether we are awesome or buggy.
ha: Bamu amsarka. Sanar da mu ko mun kyautata ko mun munana.

source: Groundbreaking App
ha: Aikace-aikacen Sabon yayiAikace-aikacen Sabon yayi

source: Health & Fitness
ha: Lafiya da Motsa jiki

source: Health & Fitness App
ha: Aikace-aikacen Lafiya & Motsa jiki Aikace-aikacen Lafiya & Motsa jiki

source: Hidden Gem
ha: Ɓoyayyen Abin AdoƁoyayyun ababen Ado

source: Home
ha: Gida

source: Homepage
ha: Shafin gida

source: I'm okay with Mozilla handling my info as explained in <a href="{privacy_policy_url}" target="_blank">this Privacy Policy</a>.
ha: Na yarda da yadda Mozilla ke gudanar da bayanai na kamar yadda aka yi bayani a <a href="{privacy_policy_url}"target="_blank">wannan manufa ta ƙashin kai</a>

source: Inappropriate language/dialog
ha: Yare/magana wadda bata yi dai dai ba

source: Install
ha: Saka

source: Installed
ha: An saka

source: Installed!
ha: As saka!

source: Install failed. Please try again later.
ha: Sakawa ta gagara. Sake gwadawa nan gaba.

source: Language Packs
ha: Ƙunshin Yaruka

source: Last updated
ha: Ƙarshen sabuntawa

source: Launch this app from your <b>Applications</b> directory.
ha: Ƙaddamar da wannan aikace-aikce daga <b>Aikace-aikace</b>jerin adireshi.

source: Launch this app from your <b>dash</b>, <b>Application picker</b>, or <b>Applications menu</b>.
ha: Ƙaddamar da wannan aikace-aikace daga <b>dash</b>mai ɗaukar aikace-aikace</b>, ko <b>Jerin bayanan Aikace-aikace.</b>.

source: Launch this app from your <b>Windows desktop</b> or <b>Start &#9658; All Programs</b>.
ha: Ƙaddamar da aikace-aikace daga <b> fuskar kwamfuta ta Windows</b>Fara &#9658; Duk Shirye-shirye</b>.

source: Learn how to change them.
ha: Koyi yadda za ka canja su.

source: Leave a Review
ha: Bar Nazari

source: Let us know...
ha: Sanar da mu...

source: Lifestyle
ha: Salon rayuwa

source: Loading...
ha: Lodawa...

source: Loading Privacy Policy...
ha: Yana ɗora Manufa ta Ƙashin kai...

source: Load more
ha: Ƙara lodi

source: Local Favorite App
ha: Aikace-aikacen Wanda aka fi so na gida

source: Lookup Tool
ha: Kayayyakin nema

source: Maps & Navigation
ha: Taswirori & Gewayawa

source: Maps & Navigation App
ha: Aikace-aikacen Taswira & Gewayawa

source: Mature 17+
ha: Balagaggu 17+

source: Misplaced bug report or support request
ha: Rahoton rashin dacewar aikin tafiyar da kwamfuta ko neman tallafi

source: More Information
ha: Ƙarin bayani

source: Most Recent Version
ha: Yayi na Kwana-kwanan nam

source: Music
ha: Kiɗa

source: My Apps
ha: Aikace-aikace na

source: Mystery App!
ha: Aikace-aikacen Abubuwan Al'ajabi

source: My Submissions
ha: Abubuwan da na miƙa

source: Need to report something?
ha: Ka son kai rahoton wani abu?

source: New
ha: Sabo

source: Newsletter
ha: Wasiƙar labarai

source: News & Weather App
ha: Aikace-aikacen Labarai & Yanayi

source: No apps found.
ha: Ba'a sami aikace-aikace ba.

source: No language packs found.
ha: Ba'a sami ƙunshin yaruka ba.

source: No results found
ha: Ba'a sami sakamako ba

source: No results found, try again later
ha: Ba'a sami sakamako ba, sake gwadawa nan gaba

source: Not enough statistics to show.
ha: Babu isasshiyar ƙididdiga da za'a nuna.

source: Not yet reviewed
ha: Ba'a sake nazari ba

source: {n} star
ha: taurari {n}

source: Oh no!
ha: Ayya!

source: Only users that are logged in may submit reviews.
ha: Masu amfani waɗanda suka shiga su ne kawai za su iya aikawa da nazari.

source: Payment cancelled.
ha: An soke biya.

source: Payment failed. Try again later.
ha: Biya ya gagara. Sake gwadawa nan gaba.

source: Photo & Video
ha: Hoto & Bidiyo

source: Photo & Video App
ha: Aikace-aikacen Hotuna & Bidiyo

source: Please set today's date and time in your device settings to access the Marketplace.
ha: Saita kwanan watan yau da lokaci a saitunan kwamfutarka domin shiga Marketplace.

source: Please sign in to view the receipt
ha: Shiga domin ganin rasitin

source: Popular
ha: Sananne

source: Premium version available
ha: Akwai yayi na biyan kuɗin inshora

source: Productivity
ha: Samarwa

source: Rate:
ha: Tantancewa

source: Rated {stars} out of {maxstars} stars
ha: An tantace {stars} daga cikin {maxstars} taurari

source: Rating Details
ha: Bayanan Tantancewa

source: Rating Pending
ha: Dakatar da Tantancewa

source: Rating Refused
ha: An ƙi Tantancewa

source: Read all reviews
ha: Karanta duk nazarce-nazarce

source: Receipt
ha: Rasiti

source: Recommendations
ha: Shawarwari

source: Reference
ha: Tushen bayani

source: Region
ha: Addini

source: Register
ha: Yi rijista

source: Report Abuse
ha: Kai rahoton Rashin jin daɗi

source: Report Trademark Abuse
ha: Kai rahoton saɓa Alamar kasuwanci

source: Reviewer Tools
ha: Kayayyakin aikin sake nazari

source: Review History
ha: Sake nazarin Tarihi

source: Reviews
ha: Sake nazari

source: Save Changes
ha: Ajiye canje-canje

source: Search Marketplace&hellip;
ha: Binciko Marketplace&hellip;

source: Search Results
ha: Bincika Sakamako

source: See an issue with this review? Select a reason below.
ha: Ka ga wata damuwa dangane da wannan nazari? Zaɓi dalili a ƙasa.

source: Settings could not be saved
ha: Ba za'a iya ajiye saituna ba

source: Shopping
ha: Cinikayya

source: Sign In
ha: Shiga

source: Sign in to review
ha: Yi rijista domin nazari

source: Sign me up
ha: Yi min rijista

source: Sign Out
ha: Fita

source: Sign up for our newsletter
ha: Yi rijista domin wasiƙarmu ta labarai

source: Sign up for our newsletter.
ha: Yi rijista domin wasiƙarmu ta labarai.

source: Social
ha: Zamantakewa

source: Sorry, there was an error posting your review. Please try again later.
ha: Yi haƙuri, akwai kuskure wajen aikawa da nazarinka. Sake gwadawa nan gaba.

source: Sorry, there was an issue editing your review. Please try again later
ha: Yi haƙuri, akwai matsala wajen gyara nazarinka. Sake gwadawa nan gaba

source: Sorry, there was an issue flagging the review. Please try again later.
ha: Yi haƙuri, akwai matsali wajen saksawa nazarinka alamar tuta. Sake gwadawa nan gaba.

source: Sorry, there was a problem deleting the review
ha: Yi haƙuri, akwai matsala wajen goge nazarin

source: Sorry, we had trouble fetching this app's data. Please try again later.
ha: Yi haƙuri, mun sami matsala wajen ɗauko bayanin wannan aikace-aikace. Sake gwadawa nan gaba.

source: Sorry, you are currently offline. Please try again later.
ha: Yi haƙuri, yanzu ba ka kan layi. Sake gwadawa nan gaba.

source: Sorry, you need to be online to access the Marketplace.
ha: Yi haƙuri, ka na bukatar kasancewa a kan layi domin shiga Marketplace.

source: Sorry, your device clock appears to be set incorrectly.
ha: Yi haƙuri, ya bayyana cewa agogon kwamfutarka an saita shi ba dai dai ba.

source: Spam or otherwise non-review content
ha: Damfara ko kuma batun da ba'a yi nazari ba

source: Sports
ha: Wasanni

source: Statistics
ha: Ƙididdiga

source: Submit Feedback
ha: Aika da amsa

source: Submit Report
ha: Aika Rahoto

source: Submit Review
ha: Aika da Nazari

source: Support
ha: Tallafi

source: Support Site
ha: Dandalin Tallafi

source: System Date Incorrect
ha: Kwanan watan Kwamfuta ba dai dai bane
